hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_trgm_regs.h
/*
 * MTG0_POS_SEL (RW)
 *
 */
#define TRGM_POS_MATRIX_SEL0_MTG0_POS_SEL_MASK (0xFF0000UL)
#define TRGM_POS_MATRIX_SEL0_MTG0_POS_SEL_SHIFT (16U)
#define TRGM_POS_MATRIX_SEL0_MTG0_POS_SEL_SET(x) (((uint32_t)(x) << TRGM_POS_MATRIX_SEL0_MTG0_POS_SEL_SHIFT) & TRGM_POS_MATRIX_SEL0_MTG0_POS_SEL_MASK)
#define TRGM_POS_MATRIX_SEL0_MTG0_POS_SEL_GET(x) (((uint32_t)(x) & TRGM_POS_MATRIX_SEL0_MTG0_POS_SEL_MASK) >> TRGM_POS_MATRIX_SEL0_MTG0_POS_SEL_SHIFT)

/*
 * SEI_POSIN1_SEL (RW)
 *
 */
#define TRGM_POS_MATRIX_SEL0_SEI_POSIN1_SEL_MASK (0xFF00U)
#define TRGM_POS_MATRIX_SEL0_SEI_POSIN1_SEL_SHIFT (8U)
#define TRGM_POS_MATRIX_SEL0_SEI_POSIN1_SEL_SET(x) (((uint32_t)(x) << TRGM_POS_MATRIX_SEL0_SEI_POSIN1_SEL_SHIFT) & TRGM_POS_MATRIX_SEL0_SEI_POSIN1_SEL_MASK)
#define TRGM_POS_MATRIX_SEL0_SEI_POSIN1_SEL_GET(x) (((uint32_t)(x) & TRGM_POS_MATRIX_SEL0_SEI_POSIN1_SEL_MASK) >> TRGM_POS_MATRIX_SEL0_SEI_POSIN1_SEL_SHIFT)

/*
 * SEI_POSIN0_SEL (RW)
 *
 */
#define TRGM_POS_MATRIX_SEL0_SEI_POSIN0_SEL_MASK (0xFFU)
#define TRGM_POS_MATRIX_SEL0_SEI_POSIN0_SEL_SHIFT (0U)
#define TRGM_POS_MATRIX_SEL0_SEI_POSIN0_SEL_SET(x) (((uint32_t)(x) << TRGM_POS_MATRIX_SEL0_SEI_POSIN0_SEL_SHIFT) & TRGM_POS_MATRIX_SEL0_SEI_POSIN0_SEL_MASK)
#define TRGM_POS_MATRIX_SEL0_SEI_POSIN0_SEL_GET(x) (((uint32_t)(x) & TRGM_POS_MATRIX_SEL0_SEI_POSIN0_SEL_MASK) >> TRGM_POS_MATRIX_SEL0_SEI_POSIN0_SEL_SHIFT)

/* Bitfield definition for register: POS_MATRIX_SEL1 */
/*
 * VSC0_POS_SEL (RW)
 *
 */
#define TRGM_POS_MATRIX_SEL1_VSC0_POS_SEL_MASK (0xFF00U)
#define TRGM_POS_MATRIX_SEL1_VSC0_POS_SEL_SHIFT (8U)
#define TRGM_POS_MATRIX_SEL1_VSC0_POS_SEL_SET(x) (((uint32_t)(x) << TRGM_POS_MATRIX_SEL1_VSC0_POS_SEL_SHIFT) & TRGM_POS_MATRIX_SEL1_VSC0_POS_SEL_MASK)
#define TRGM_POS_MATRIX_SEL1_VSC0_POS_SEL_GET(x) (((uint32_t)(x) & TRGM_POS_MATRIX_SEL1_VSC0_POS_SEL_MASK) >> TRGM_POS_MATRIX_SEL1_VSC0_POS_SEL_SHIFT)

/*
 * QEO1_POS_SEL (RW)
 *
 */
#define TRGM_POS_MATRIX_SEL1_QEO1_POS_SEL_MASK (0xFFU)
#define TRGM_POS_MATRIX_SEL1_QEO1_POS_SEL_SHIFT (0U)
#define TRGM_POS_MATRIX_SEL1_QEO1_POS_SEL_SET(x) (((uint32_t)(x) << TRGM_POS_MATRIX_SEL1_QEO1_POS_SEL_SHIFT) & TRGM_POS_MATRIX_SEL1_QEO1_POS_SEL_MASK)
#define TRGM_POS_MATRIX_SEL1_QEO1_POS_SEL_GET(x) (((uint32_t)(x) & TRGM_POS_MATRIX_SEL1_QEO1_POS_SEL_MASK) >> TRGM_POS_MATRIX_SEL1_QEO1_POS_SEL_SHIFT)

/* Bitfield definition for register array: TRGM_IN */
/*
 * TRGM_IN (RO)
 *
 */
#define TRGM_TRGM_IN_TRGM_IN_MASK (0xFFFFFFFFUL)
#define TRGM_TRGM_IN_TRGM_IN_SHIFT (0U)
#define TRGM_TRGM_IN_TRGM_IN_GET(x) (((uint32_t)(x) & TRGM_TRGM_IN_TRGM_IN_MASK) >> TRGM_TRGM_IN_TRGM_IN_SHIFT)

/* Bitfield definition for register array: TRGM_OUT */
/*
 * TRGM_OUT (RO)
 *
 */
#define TRGM_TRGM_OUT_TRGM_OUT_MASK (0xFFFFFFFFUL)
#define TRGM_TRGM_OUT_TRGM_OUT_SHIFT (0U)
#define TRGM_TRGM_OUT_TRGM_OUT_GET(x) (((uint32_t)(x) & TRGM_TRGM_OUT_TRGM_OUT_MASK) >> TRGM_TRGM_OUT_TRGM_OUT_SHIFT)

/* Bitfield definition for register: PWM_DELAY_CFG */
/*
 * DELAY_CHAN_CALIB_N_SW (RW)
 *
 * set none-zero value to use this value as clock low time in delay_chain step value
 */
#define TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_N_SW_MASK (0x3F00U)
#define TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_N_SW_SHIFT (8U)
#define TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_N_SW_SET(x) (((uint32_t)(x) << TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_N_SW_SHIFT) & TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_N_SW_MASK)
#define TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_N_SW_GET(x) (((uint32_t)(x) & TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_N_SW_MASK) >> TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_N_SW_SHIFT)

/*
 * DELAY_CHAN_CALIB_P_SW (RW)
 *
 * set none-zero value to use this value as clock high time in delay_chain step value
 */
#define TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_P_SW_MASK (0x3FU)
#define TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_P_SW_SHIFT (0U)
#define TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_P_SW_SET(x) (((uint32_t)(x) << TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_P_SW_SHIFT) & TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_P_SW_MASK)
#define TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_P_SW_GET(x) (((uint32_t)(x) & TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_P_SW_MASK) >> TRGM_PWM_DELAY_CFG_DELAY_CHAN_CALIB_P_SW_SHIFT)

/* Bitfield definition for register: PWM_CALIB_CFG */
/*
 * CALIB_SW_START (RW)
 *
 * set to trigger calibration once by software, need to be cleared first before setting it
 */
#define TRGM_PWM_CALIB_CFG_CALIB_SW_START_MASK (0x8000U)
#define TRGM_PWM_CALIB_CFG_CALIB_SW_START_SHIFT (15U)
#define TRGM_PWM_CALIB_CFG_CALIB_SW_START_SET(x) (((uint32_t)(x) << TRGM_PWM_CALIB_CFG_CALIB_SW_START_SHIFT) & TRGM_PWM_CALIB_CFG_CALIB_SW_START_MASK)
#define TRGM_PWM_CALIB_CFG_CALIB_SW_START_GET(x) (((uint32_t)(x) & TRGM_PWM_CALIB_CFG_CALIB_SW_START_MASK) >> TRGM_PWM_CALIB_CFG_CALIB_SW_START_SHIFT)

/*
 * CALIB_HW_ENABLE (RW)
 *
 * hardware calibration enable
 */
#define TRGM_PWM_CALIB_CFG_CALIB_HW_ENABLE_MASK (0x80U)
#define TRGM_PWM_CALIB_CFG_CALIB_HW_ENABLE_SHIFT (7U)
#define TRGM_PWM_CALIB_CFG_CALIB_HW_ENABLE_SET(x) (((uint32_t)(x) << TRGM_PWM_CALIB_CFG_CALIB_HW_ENABLE_SHIFT) & TRGM_PWM_CALIB_CFG_CALIB_HW_ENABLE_MASK)
#define TRGM_PWM_CALIB_CFG_CALIB_HW_ENABLE_GET(x) (((uint32_t)(x) & TRGM_PWM_CALIB_CFG_CALIB_HW_ENABLE_MASK) >> TRGM_PWM_CALIB_CFG_CALIB_HW_ENABLE_SHIFT)

/* Bitfield definition for register: PWM_CALIB_STATUS0 */
/*
 * CALIB_ON (RO)
 *
 */
#define TRGM_PWM_CALIB_STATUS0_CALIB_ON_MASK (0x80000000UL)
#define TRGM_PWM_CALIB_STATUS0_CALIB_ON_SHIFT (31U)
#define TRGM_PWM_CALIB_STATUS0_CALIB_ON_GET(x) (((uint32_t)(x) & TRGM_PWM_CALIB_STATUS0_CALIB_ON_MASK) >> TRGM_PWM_CALIB_STATUS0_CALIB_ON_SHIFT)

/* Bitfield definition for register: PWM_CALIB_STATUS1 */
/*
 * CALIB_RESULT_N (RO)
 *
 */
#define TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_N_MASK (0x3F00U)
#define TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_N_SHIFT (8U)
#define TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_N_GET(x) (((uint32_t)(x) & TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_N_MASK) >> TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_N_SHIFT)

/*
 * CALIB_RESULT_P (RO)
 *
 */
#define TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_P_MASK (0x3FU)
#define TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_P_SHIFT (0U)
#define TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_P_GET(x) (((uint32_t)(x) & TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_P_MASK) >> TRGM_PWM_CALIB_STATUS1_CALIB_RESULT_P_SHIFT)

/* Bitfield definition for register array: TRGOCFG */
/*
 * OUTINV (RW)
 *
 * 1- Invert the output
 */
#define TRGM_TRGOCFG_OUTINV_MASK (0x40000UL)
#define TRGM_TRGOCFG_OUTINV_SHIFT (18U)
#define TRGM_TRGOCFG_OUTINV_SET(x) (((uint32_t)(x) << TRGM_TRGOCFG_OUTINV_SHIFT) & TRGM_TRGOCFG_OUTINV_MASK)
#define TRGM_TRGOCFG_OUTINV_GET(x) (((uint32_t)(x) & TRGM_TRGOCFG_OUTINV_MASK) >> TRGM_TRGOCFG_OUTINV_SHIFT)

