hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_trgm_regs.h
/*
 * FEDG2PEN (RW)
 *
 * 1- The selected input signal falling edge will be convert to an pulse on output. The output pulse can be stably used within the motor control system. When connecting the signal outside the motor system, due to the asynchronization of the clock systems, the clock frequency and signal active length need to be considered.
 */
#define TRGM_TRGOCFG_FEDG2PEN_MASK (0x20000UL)
#define TRGM_TRGOCFG_FEDG2PEN_SHIFT (17U)
#define TRGM_TRGOCFG_FEDG2PEN_SET(x) (((uint32_t)(x) << TRGM_TRGOCFG_FEDG2PEN_SHIFT) & TRGM_TRGOCFG_FEDG2PEN_MASK)
#define TRGM_TRGOCFG_FEDG2PEN_GET(x) (((uint32_t)(x) & TRGM_TRGOCFG_FEDG2PEN_MASK) >> TRGM_TRGOCFG_FEDG2PEN_SHIFT)

/*
 * REDG2PEN (RW)
 *
 * 1- The selected input signal rising edge will be convert to an pulse on output. The output pulse can be stably used within the motor control system. When connecting the signal outside the motor system, due to the asynchronization of the clock systems, the clock frequency and signal active length need to be considered.
 */
#define TRGM_TRGOCFG_REDG2PEN_MASK (0x10000UL)
#define TRGM_TRGOCFG_REDG2PEN_SHIFT (16U)
#define TRGM_TRGOCFG_REDG2PEN_SET(x) (((uint32_t)(x) << TRGM_TRGOCFG_REDG2PEN_SHIFT) & TRGM_TRGOCFG_REDG2PEN_MASK)
#define TRGM_TRGOCFG_REDG2PEN_GET(x) (((uint32_t)(x) & TRGM_TRGOCFG_REDG2PEN_MASK) >> TRGM_TRGOCFG_REDG2PEN_SHIFT)

/*
 * TRIGOSEL (RW)
 *
 * This bitfield selects one of the TRGM inputs as output.
 */
#define TRGM_TRGOCFG_TRIGOSEL_MASK (0xFFU)
#define TRGM_TRGOCFG_TRIGOSEL_SHIFT (0U)
#define TRGM_TRGOCFG_TRIGOSEL_SET(x) (((uint32_t)(x) << TRGM_TRGOCFG_TRIGOSEL_SHIFT) & TRGM_TRGOCFG_TRIGOSEL_MASK)
#define TRGM_TRGOCFG_TRIGOSEL_GET(x) (((uint32_t)(x) & TRGM_TRGOCFG_TRIGOSEL_MASK) >> TRGM_TRGOCFG_TRIGOSEL_SHIFT)



/* FILTCFG register group index macro definition */
#define TRGM_FILTCFG_PWM0_IN0 (0UL)
#define TRGM_FILTCFG_PWM0_IN1 (1UL)
#define TRGM_FILTCFG_PWM0_IN2 (2UL)
#define TRGM_FILTCFG_PWM0_IN3 (3UL)
#define TRGM_FILTCFG_PWM0_IN4 (4UL)
#define TRGM_FILTCFG_PWM0_IN5 (5UL)
#define TRGM_FILTCFG_PWM0_IN6 (6UL)
#define TRGM_FILTCFG_PWM0_IN7 (7UL)
#define TRGM_FILTCFG_PWM1_IN0 (8UL)
#define TRGM_FILTCFG_PWM1_IN1 (9UL)
#define TRGM_FILTCFG_PWM1_IN2 (10UL)
#define TRGM_FILTCFG_PWM1_IN3 (11UL)
#define TRGM_FILTCFG_PWM1_IN4 (12UL)
#define TRGM_FILTCFG_PWM1_IN5 (13UL)
#define TRGM_FILTCFG_PWM1_IN6 (14UL)
#define TRGM_FILTCFG_PWM1_IN7 (15UL)
#define TRGM_FILTCFG_PWM2_IN0 (16UL)
#define TRGM_FILTCFG_PWM2_IN1 (17UL)
#define TRGM_FILTCFG_PWM2_IN2 (18UL)
#define TRGM_FILTCFG_PWM2_IN3 (19UL)
#define TRGM_FILTCFG_PWM2_IN4 (20UL)
#define TRGM_FILTCFG_PWM2_IN5 (21UL)
#define TRGM_FILTCFG_PWM2_IN6 (22UL)
#define TRGM_FILTCFG_PWM2_IN7 (23UL)
#define TRGM_FILTCFG_PWM3_IN0 (24UL)
#define TRGM_FILTCFG_PWM3_IN1 (25UL)
#define TRGM_FILTCFG_PWM3_IN2 (26UL)
#define TRGM_FILTCFG_PWM3_IN3 (27UL)
#define TRGM_FILTCFG_PWM3_IN4 (28UL)
#define TRGM_FILTCFG_PWM3_IN5 (29UL)
#define TRGM_FILTCFG_PWM3_IN6 (30UL)
#define TRGM_FILTCFG_PWM3_IN7 (31UL)
#define TRGM_FILTCFG_TRGM_P_00 (32UL)
#define TRGM_FILTCFG_TRGM_P_01 (33UL)
#define TRGM_FILTCFG_TRGM_P_02 (34UL)
#define TRGM_FILTCFG_TRGM_P_03 (35UL)
#define TRGM_FILTCFG_TRGM_P_04 (36UL)
#define TRGM_FILTCFG_TRGM_P_05 (37UL)
#define TRGM_FILTCFG_TRGM_P_06 (38UL)
#define TRGM_FILTCFG_TRGM_P_07 (39UL)
#define TRGM_FILTCFG_TRGM_P_08 (40UL)
#define TRGM_FILTCFG_TRGM_P_09 (41UL)
#define TRGM_FILTCFG_TRGM_P_10 (42UL)
#define TRGM_FILTCFG_TRGM_P_11 (43UL)
#define TRGM_FILTCFG_TRGM_P_12 (44UL)
#define TRGM_FILTCFG_TRGM_P_13 (45UL)
#define TRGM_FILTCFG_TRGM_P_14 (46UL)
#define TRGM_FILTCFG_TRGM_P_15 (47UL)
#define TRGM_FILTCFG_TRGM_P_16 (48UL)
#define TRGM_FILTCFG_TRGM_P_17 (49UL)
#define TRGM_FILTCFG_TRGM_P_18 (50UL)
#define TRGM_FILTCFG_TRGM_P_19 (51UL)
#define TRGM_FILTCFG_TRGM_P_20 (52UL)
#define TRGM_FILTCFG_TRGM_P_21 (53UL)
#define TRGM_FILTCFG_TRGM_P_22 (54UL)
#define TRGM_FILTCFG_TRGM_P_23 (55UL)
#define TRGM_FILTCFG_TRGM_P_24 (56UL)
#define TRGM_FILTCFG_TRGM_P_25 (57UL)
#define TRGM_FILTCFG_TRGM_P_26 (58UL)
#define TRGM_FILTCFG_TRGM_P_27 (59UL)
#define TRGM_FILTCFG_TRGM_P_28 (60UL)
#define TRGM_FILTCFG_TRGM_P_29 (61UL)
#define TRGM_FILTCFG_TRGM_P_30 (62UL)
#define TRGM_FILTCFG_TRGM_P_31 (63UL)

/* DMACFG register group index macro definition */
#define TRGM_DMACFG_0 (0UL)
#define TRGM_DMACFG_1 (1UL)
#define TRGM_DMACFG_2 (2UL)
#define TRGM_DMACFG_3 (3UL)
#define TRGM_DMACFG_4 (4UL)
#define TRGM_DMACFG_5 (5UL)
#define TRGM_DMACFG_6 (6UL)
#define TRGM_DMACFG_7 (7UL)

/* TRGM_IN register group index macro definition */
#define TRGM_TRGM_IN_0 (0UL)
#define TRGM_TRGM_IN_1 (1UL)
#define TRGM_TRGM_IN_2 (2UL)
#define TRGM_TRGM_IN_3 (3UL)
#define TRGM_TRGM_IN_4 (4UL)
#define TRGM_TRGM_IN_5 (5UL)
#define TRGM_TRGM_IN_6 (6UL)

/* TRGM_OUT register group index macro definition */
#define TRGM_TRGM_OUT_0 (0UL)
#define TRGM_TRGM_OUT_1 (1UL)
#define TRGM_TRGM_OUT_2 (2UL)
#define TRGM_TRGM_OUT_3 (3UL)
#define TRGM_TRGM_OUT_4 (4UL)
#define TRGM_TRGM_OUT_5 (5UL)
#define TRGM_TRGM_OUT_6 (6UL)

/* TRGOCFG register group index macro definition */
#define TRGM_TRGOCFG_TRGM_P_00 (0UL)
#define TRGM_TRGOCFG_TRGM_P_01 (1UL)
#define TRGM_TRGOCFG_TRGM_P_02 (2UL)
#define TRGM_TRGOCFG_TRGM_P_03 (3UL)
#define TRGM_TRGOCFG_TRGM_P_04 (4UL)
#define TRGM_TRGOCFG_TRGM_P_05 (5UL)
#define TRGM_TRGOCFG_TRGM_P_06 (6UL)
#define TRGM_TRGOCFG_TRGM_P_07 (7UL)
#define TRGM_TRGOCFG_TRGM_P_08 (8UL)
#define TRGM_TRGOCFG_TRGM_P_09 (9UL)
#define TRGM_TRGOCFG_TRGM_P_10 (10UL)
#define TRGM_TRGOCFG_TRGM_P_11 (11UL)
#define TRGM_TRGOCFG_TRGM_P_12 (12UL)
#define TRGM_TRGOCFG_TRGM_P_13 (13UL)
#define TRGM_TRGOCFG_TRGM_P_14 (14UL)
#define TRGM_TRGOCFG_TRGM_P_15 (15UL)
#define TRGM_TRGOCFG_TRGM_P_16 (16UL)
#define TRGM_TRGOCFG_TRGM_P_17 (17UL)
#define TRGM_TRGOCFG_TRGM_P_18 (18UL)
#define TRGM_TRGOCFG_TRGM_P_19 (19UL)
#define TRGM_TRGOCFG_TRGM_P_20 (20UL)
#define TRGM_TRGOCFG_TRGM_P_21 (21UL)
#define TRGM_TRGOCFG_TRGM_P_22 (22UL)
#define TRGM_TRGOCFG_TRGM_P_23 (23UL)
#define TRGM_TRGOCFG_TRGM_P_24 (24UL)
#define TRGM_TRGOCFG_TRGM_P_25 (25UL)
#define TRGM_TRGOCFG_TRGM_P_26 (26UL)
#define TRGM_TRGOCFG_TRGM_P_27 (27UL)
#define TRGM_TRGOCFG_TRGM_P_28 (28UL)
#define TRGM_TRGOCFG_TRGM_P_29 (29UL)
#define TRGM_TRGOCFG_TRGM_P_30 (30UL)
#define TRGM_TRGOCFG_TRGM_P_31 (31UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC0 (32UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC1 (33UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC2 (34UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC3 (35UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC4 (36UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC5 (37UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC6 (38UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC7 (39UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC8 (40UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC9 (41UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC10 (42UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC11 (43UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC12 (44UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC13 (45UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC14 (46UL)
#define TRGM_TRGOCFG_SDM_PWM_SOC15 (47UL)
#define TRGM_TRGOCFG_ADC0_STRGI (48UL)
#define TRGM_TRGOCFG_ADC1_STRGI (49UL)
#define TRGM_TRGOCFG_ADC2_STRGI (50UL)
#define TRGM_TRGOCFG_ADC3_STRGI (51UL)
#define TRGM_TRGOCFG_ADCX_PTRGI0A (52UL)
#define TRGM_TRGOCFG_ADCX_PTRGI0B (53UL)
#define TRGM_TRGOCFG_ADCX_PTRGI0C (54UL)
#define TRGM_TRGOCFG_ADCX_PTRGI1A (55UL)
#define TRGM_TRGOCFG_ADCX_PTRGI1B (56UL)
#define TRGM_TRGOCFG_ADCX_PTRGI1C (57UL)
#define TRGM_TRGOCFG_ADCX_PTRGI2A (58UL)
#define TRGM_TRGOCFG_ADCX_PTRGI2B (59UL)
#define TRGM_TRGOCFG_ADCX_PTRGI2C (60UL)
#define TRGM_TRGOCFG_ADCX_PTRGI3A (61UL)
#define TRGM_TRGOCFG_ADCX_PTRGI3B (62UL)
#define TRGM_TRGOCFG_ADCX_PTRGI3C (63UL)
#define TRGM_TRGOCFG_VSC0_TRIG_IN0 (64UL)
#define TRGM_TRGOCFG_VSC0_TRIG_IN1 (65UL)
#define TRGM_TRGOCFG_RDC0_TRIG_IN0 (66UL)
#define TRGM_TRGOCFG_RDC0_TRIG_IN1 (67UL)
#define TRGM_TRGOCFG_QEI0_TRIG_IN (68UL)
#define TRGM_TRGOCFG_QEI1_TRIG_IN (69UL)
#define TRGM_TRGOCFG_QEI0_PAUSE (70UL)
#define TRGM_TRGOCFG_QEI1_PAUSE (71UL)
#define TRGM_TRGOCFG_QEO0_TRIG_IN0 (72UL)
#define TRGM_TRGOCFG_QEO0_TRIG_IN1 (73UL)
#define TRGM_TRGOCFG_QEO1_TRIG_IN0 (74UL)
#define TRGM_TRGOCFG_QEO1_TRIG_IN1 (75UL)
#define TRGM_TRGOCFG_SEI_TRIG_IN0 (76UL)
#define TRGM_TRGOCFG_SEI_TRIG_IN1 (77UL)
#define TRGM_TRGOCFG_SEI_TRIG_IN2 (78UL)
#define TRGM_TRGOCFG_SEI_TRIG_IN3 (79UL)
#define TRGM_TRGOCFG_SEI_TRIG_IN4 (80UL)
#define TRGM_TRGOCFG_SEI_TRIG_IN5 (81UL)
#define TRGM_TRGOCFG_SEI_TRIG_IN6 (82UL)
#define TRGM_TRGOCFG_SEI_TRIG_IN7 (83UL)
#define TRGM_TRGOCFG_ACMP0_CH0_WIN (84UL)
#define TRGM_TRGOCFG_ACMP0_CH1_WIN (85UL)
#define TRGM_TRGOCFG_ACMP1_CH0_WIN (86UL)
#define TRGM_TRGOCFG_ACMP1_CH1_WIN (87UL)
#define TRGM_TRGOCFG_ACMP2_CH0_WIN (88UL)
#define TRGM_TRGOCFG_ACMP2_CH1_WIN (89UL)
#define TRGM_TRGOCFG_ACMP3_CH0_WIN (90UL)
#define TRGM_TRGOCFG_ACMP3_CH1_WIN (91UL)
#define TRGM_TRGOCFG_DAC0_BUFTRG (92UL)
#define TRGM_TRGOCFG_DAC1_BUFTRG (93UL)
#define TRGM_TRGOCFG_GPTMR0_IN2 (94UL)
#define TRGM_TRGOCFG_GPTMR0_IN3 (95UL)
#define TRGM_TRGOCFG_GPTMR0_SYNCI (96UL)
#define TRGM_TRGOCFG_GPTMR1_IN2 (97UL)
#define TRGM_TRGOCFG_GPTMR1_IN3 (98UL)
#define TRGM_TRGOCFG_GPTMR1_SYNCI (99UL)
#define TRGM_TRGOCFG_GPTMR2_IN2 (100UL)
#define TRGM_TRGOCFG_GPTMR2_IN3 (101UL)
#define TRGM_TRGOCFG_GPTMR2_SYNCI (102UL)
#define TRGM_TRGOCFG_GPTMR3_IN2 (103UL)
#define TRGM_TRGOCFG_GPTMR3_IN3 (104UL)
#define TRGM_TRGOCFG_GPTMR3_SYNCI (105UL)
#define TRGM_TRGOCFG_PLB_IN_00 (106UL)
#define TRGM_TRGOCFG_PLB_IN_01 (107UL)
#define TRGM_TRGOCFG_PLB_IN_02 (108UL)
#define TRGM_TRGOCFG_PLB_IN_03 (109UL)
#define TRGM_TRGOCFG_PLB_IN_04 (110UL)
#define TRGM_TRGOCFG_PLB_IN_05 (111UL)
#define TRGM_TRGOCFG_PLB_IN_06 (112UL)
#define TRGM_TRGOCFG_PLB_IN_07 (113UL)
#define TRGM_TRGOCFG_PLB_IN_08 (114UL)
#define TRGM_TRGOCFG_PLB_IN_09 (115UL)
#define TRGM_TRGOCFG_PLB_IN_10 (116UL)
#define TRGM_TRGOCFG_PLB_IN_11 (117UL)
#define TRGM_TRGOCFG_PLB_IN_12 (118UL)
#define TRGM_TRGOCFG_PLB_IN_13 (119UL)
#define TRGM_TRGOCFG_PLB_IN_14 (120UL)
#define TRGM_TRGOCFG_PLB_IN_15 (121UL)
#define TRGM_TRGOCFG_PLB_IN_16 (122UL)
#define TRGM_TRGOCFG_PLB_IN_17 (123UL)
#define TRGM_TRGOCFG_PLB_IN_18 (124UL)
#define TRGM_TRGOCFG_PLB_IN_19 (125UL)
#define TRGM_TRGOCFG_PLB_IN_20 (126UL)
#define TRGM_TRGOCFG_PLB_IN_21 (127UL)
#define TRGM_TRGOCFG_PLB_IN_22 (128UL)
#define TRGM_TRGOCFG_PLB_IN_23 (129UL)
#define TRGM_TRGOCFG_PLB_IN_24 (130UL)
#define TRGM_TRGOCFG_PLB_IN_25 (131UL)
#define TRGM_TRGOCFG_PLB_IN_26 (132UL)
#define TRGM_TRGOCFG_PLB_IN_27 (133UL)
#define TRGM_TRGOCFG_PLB_IN_28 (134UL)
#define TRGM_TRGOCFG_PLB_IN_29 (135UL)
#define TRGM_TRGOCFG_PLB_IN_30 (136UL)
#define TRGM_TRGOCFG_PLB_IN_31 (137UL)
#define TRGM_TRGOCFG_PLB_IN_32 (138UL)
#define TRGM_TRGOCFG_PLB_IN_33 (139UL)
#define TRGM_TRGOCFG_PLB_IN_34 (140UL)
#define TRGM_TRGOCFG_PLB_IN_35 (141UL)
#define TRGM_TRGOCFG_PLB_IN_36 (142UL)
#define TRGM_TRGOCFG_PLB_IN_37 (143UL)
#define TRGM_TRGOCFG_PLB_IN_38 (144UL)
#define TRGM_TRGOCFG_PLB_IN_39 (145UL)
#define TRGM_TRGOCFG_PLB_IN_40 (146UL)
#define TRGM_TRGOCFG_PLB_IN_41 (147UL)
#define TRGM_TRGOCFG_PLB_IN_42 (148UL)
#define TRGM_TRGOCFG_PLB_IN_43 (149UL)
#define TRGM_TRGOCFG_PLB_IN_44 (150UL)
#define TRGM_TRGOCFG_PLB_IN_45 (151UL)
#define TRGM_TRGOCFG_PLB_IN_46 (152UL)
#define TRGM_TRGOCFG_PLB_IN_47 (153UL)
#define TRGM_TRGOCFG_PLB_IN_48 (154UL)
#define TRGM_TRGOCFG_PLB_IN_49 (155UL)
#define TRGM_TRGOCFG_PLB_IN_50 (156UL)
#define TRGM_TRGOCFG_PLB_IN_51 (157UL)
#define TRGM_TRGOCFG_PLB_IN_52 (158UL)
#define TRGM_TRGOCFG_PLB_IN_53 (159UL)
#define TRGM_TRGOCFG_PLB_IN_54 (160UL)
#define TRGM_TRGOCFG_PLB_IN_55 (161UL)
#define TRGM_TRGOCFG_PLB_IN_56 (162UL)
#define TRGM_TRGOCFG_PLB_IN_57 (163UL)
#define TRGM_TRGOCFG_PLB_IN_58 (164UL)
#define TRGM_TRGOCFG_PLB_IN_59 (165UL)
#define TRGM_TRGOCFG_PLB_IN_60 (166UL)
#define TRGM_TRGOCFG_PLB_IN_61 (167UL)
#define TRGM_TRGOCFG_PLB_IN_62 (168UL)
#define TRGM_TRGOCFG_PLB_IN_63 (169UL)
#define TRGM_TRGOCFG_PWM0_TRIG_IN0 (170UL)
#define TRGM_TRGOCFG_PWM0_TRIG_IN1 (171UL)
#define TRGM_TRGOCFG_PWM0_TRIG_IN2 (172UL)
#define TRGM_TRGOCFG_PWM0_TRIG_IN3 (173UL)
#define TRGM_TRGOCFG_PWM0_TRIG_IN4 (174UL)
#define TRGM_TRGOCFG_PWM0_TRIG_IN5 (175UL)
#define TRGM_TRGOCFG_PWM0_TRIG_IN6 (176UL)
#define TRGM_TRGOCFG_PWM0_TRIG_IN7 (177UL)
#define TRGM_TRGOCFG_PWM1_TRIG_IN0 (178UL)
#define TRGM_TRGOCFG_PWM1_TRIG_IN1 (179UL)
#define TRGM_TRGOCFG_PWM1_TRIG_IN2 (180UL)
#define TRGM_TRGOCFG_PWM1_TRIG_IN3 (181UL)
#define TRGM_TRGOCFG_PWM1_TRIG_IN4 (182UL)
#define TRGM_TRGOCFG_PWM1_TRIG_IN5 (183UL)
#define TRGM_TRGOCFG_PWM1_TRIG_IN6 (184UL)
#define TRGM_TRGOCFG_PWM1_TRIG_IN7 (185UL)
#define TRGM_TRGOCFG_PWM2_TRIG_IN0 (186UL)
#define TRGM_TRGOCFG_PWM2_TRIG_IN1 (187UL)
#define TRGM_TRGOCFG_PWM2_TRIG_IN2 (188UL)
#define TRGM_TRGOCFG_PWM2_TRIG_IN3 (189UL)
#define TRGM_TRGOCFG_PWM2_TRIG_IN4 (190UL)
#define TRGM_TRGOCFG_PWM2_TRIG_IN5 (191UL)
#define TRGM_TRGOCFG_PWM2_TRIG_IN6 (192UL)
#define TRGM_TRGOCFG_PWM2_TRIG_IN7 (193UL)
#define TRGM_TRGOCFG_PWM3_TRIG_IN0 (194UL)
#define TRGM_TRGOCFG_PWM3_TRIG_IN1 (195UL)
#define TRGM_TRGOCFG_PWM3_TRIG_IN2 (196UL)
#define TRGM_TRGOCFG_PWM3_TRIG_IN3 (197UL)
#define TRGM_TRGOCFG_PWM3_TRIG_IN4 (198UL)
#define TRGM_TRGOCFG_PWM3_TRIG_IN5 (199UL)
#define TRGM_TRGOCFG_PWM3_TRIG_IN6 (200UL)
#define TRGM_TRGOCFG_PWM3_TRIG_IN7 (201UL)
#define TRGM_TRGOCFG_CAN_PTPC0_CAP (202UL)
#define TRGM_TRGOCFG_CAN_PTPC1_CAP (203UL)
#define TRGM_TRGOCFG_UART_TRIG0 (204UL)
#define TRGM_TRGOCFG_UART_TRIG1 (205UL)
#define TRGM_TRGOCFG_SYNCTIMER_TRIG (206UL)
#define TRGM_TRGOCFG_TRGM_IRQ0 (207UL)
#define TRGM_TRGOCFG_TRGM_IRQ1 (208UL)
#define TRGM_TRGOCFG_TRGM_DMA0 (209UL)
#define TRGM_TRGOCFG_TRGM_DMA1 (210UL)
#define TRGM_TRGOCFG_MTG0_TRIG_IN0 (211UL)
#define TRGM_TRGOCFG_MTG0_TRIG_IN1 (212UL)
#define TRGM_TRGOCFG_MTG0_TRIG_IN2 (213UL)
#define TRGM_TRGOCFG_MTG0_TRIG_IN3 (214UL)
#define TRGM_TRGOCFG_SYNT_TRIG_IN (215UL)


#endif /* HPM_TRGM_H */
